# Задание 1
# Необходимо вывести имена всех учеников из списка с новой строки

names = ['Оля', 'Петя', 'Вася', 'Маша']
# ???
print('Задание 1:')

for i in names:
    print(i)

# Задание 2
# Необходимо вывести имена всех учеников из списка, рядом с именем показать количество букв в нём.

names = ['Оля', 'Петя', 'Вася', 'Маша']
# ???
print('\nЗадание 2:')

for i in names:
    print("{}, длина: {}шт.".format(i, len(i)))

# Задание 3
# Необходимо вывести имена всех учеников из списка, рядом с именем вывести пол ученика

is_male = {
  'Оля': False,  #если True, то пол мужской
  'Петя': True,
  'Вася': True,
  'Маша': False,
}
names = ['Оля', 'Петя', 'Вася', 'Маша']
# ???
print('\nЗадание 3:')

for i in is_male:
    print("{} {}".format(i, 'М' if is_male[i] else 'Ж'))

# Задание 4
# Даны группу учеников. Нужно вывести количество групп и для каждой группы – количество учеников в ней
# Пример вывода:
# Всего 2 группы.
# В группе 2 ученика.
# В группе 3 ученика.

groups = [
  ['Вася', 'Маша'],
  ['Оля', 'Петя', 'Гриша'],
]
# ???
print('\nЗадание 4:')

print('Всего групп: {}'.format(len(groups)))
count = 0
for i in groups:
    count += 1
    print('В {} группе {} ученика'.format(count, len(i)))


# Задание 5
# Для каждой пары учеников нужно с новой строки перечислить учеников, которые в неё входят.
# Пример:
# Группа 1: Вася, Маша
# Группа 2: Оля, Петя, Гриша

groups = [
  ['Вася', 'Маша'],
  ['Оля', 'Петя', 'Гриша'],
]
# ???
print('\nЗадание 5:')

count = 0
for i in groups:
    count = groups.index(i) + 1
    group = ''
    for j in i:
        group += j + ', '
    print('Группа {}: {}'.format(count, group[:len(group) - 2]))
